ubuntu_file.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>文件管理</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="文件管理"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-11 Wed"/>
<meta name="author" content="Joseph Pan"/>
<meta name="description" content="Ubuntu文件管理"/>
<meta name="keywords" content="Ubuntu 文件管理 cat more less grep"/>
<link rel="stylesheet" href="./other/style.css" type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="./ubuntu_index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">文件管理</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 创建</a>
<ul>
<li><a href="#sec-1-1">1.1 创建两个空文件</a></li>
<li><a href="#sec-1-2">1.2 递归式创建一些嵌套目录</a></li>
<li><a href="#sec-1-3">1.3 复制文件或者目录</a></li>
</ul>
</li>
<li><a href="#sec-2">2 查看</a>
<ul>
<li><a href="#sec-2-1">2.1 一屏查看文件内容</a></li>
<li><a href="#sec-2-2">2.2 不显示以＃开头的行</a></li>
<li><a href="#sec-2-3">2.3 分页查看文件内容</a></li>
<li><a href="#sec-2-4">2.4 可控分页查看文件内容</a></li>
<li><a href="#sec-2-5">2.5 带行号显示文件的内容</a></li>
<li><a href="#sec-2-6">2.6 根据字符串匹配来查看文件部分内容</a></li>
<li><a href="#sec-2-7">2.7 回当前用户的宿主目录</a></li>
<li><a href="#sec-2-8">2.8 回到上一次的目录</a></li>
<li><a href="#sec-2-9">2.9 查看当前所在目录的绝对路经</a></li>
<li><a href="#sec-2-10">2.10 列出当前目录下的所有文件,包括以.开头的隐含文件</a></li>
<li><a href="#sec-2-11">2.11 查看文件类型</a></li>
<li><a href="#sec-2-12">2.12 显示xxx文件倒数6行的内容</a></li>
<li><a href="#sec-2-13">2.13 查看文件中间的第五行（含）到第10行（含）的内容</a></li>
<li><a href="#sec-2-14">2.14 查看当前目录的子目录</a></li>
<li><a href="#sec-2-15">2.15 将当前目录下最近2小时到8小时之内的文件显示出来</a></li>
</ul>
</li>
<li><a href="#sec-3">3 修改</a>
<ul>
<li><a href="#sec-3-1">3.1 去除文件中的行号</a></li>
<li><a href="#sec-3-2">3.2 删除文件中的重复行</a></li>
<li><a href="#sec-3-3">3.3 显示包含或者不包含字符串的文件名</a></li>
<li><a href="#sec-3-4">3.4 获得文件的后缀名</a></li>
<li><a href="#sec-3-5">3.5 去除文件的后缀名</a></li>
<li><a href="#sec-3-6">3.6 移动路径下的文件并改名</a></li>
<li><a href="#sec-3-7">3.7 把所有文件的後辍由rm改为rmvb</a></li>
<li><a href="#sec-3-8">3.8 把所有文件名中的大写改为小写</a></li>
<li><a href="#sec-3-9">3.9 去掉文件中的^M</a></li>
<li><a href="#sec-3-10">3.10 合并多个pdf文件到一个pdf文件</a></li>
<li><a href="#sec-3-11">3.11 批量修改文件和目录的权限</a></li>
</ul>
</li>
<li><a href="#sec-4">4 删除</a>
<ul>
<li><a href="#sec-4-1">4.1 递归式删除嵌套目录</a></li>
<li><a href="#sec-4-2">4.2 删除特殊文件名的文件，如文件名：&ndash;help.txt</a></li>
<li><a href="#sec-4-3">4.3 删除当前目录里面所有的 .svn 目录</a></li>
<li><a href="#sec-4-4">4.4 删除当前目录所有以“~”结尾的临时文件</a></li>
</ul>
</li>
<li><a href="#sec-5">5 查找</a>
<ul>
<li><a href="#sec-5-1">5.1 快速查找某个文件</a></li>
<li><a href="#sec-5-2">5.2 查找不以java和xml结尾,并7天没有使用的文件删除掉</a></li>
<li><a href="#sec-5-3">5.3 查找目录下所有有包含abcd文字的文本文件，并替换为xyz</a></li>
</ul>
</li>
<li><a href="#sec-6">6 比较</a>
<ul>
<li><a href="#sec-6-1">6.1 对比两个文件之间的差异　</a></li>
<li><a href="#sec-6-2">6.2 比较两个目录里面的文件是否有相同</a></li>
</ul>
</li>
<li><a href="#sec-7">7 统计</a>
<ul>
<li><a href="#sec-7-1">7.1 统计当前文件个数</a></li>
<li><a href="#sec-7-2">7.2 统计最常用的10条命令</a></li>
<li><a href="#sec-7-3">7.3 统计每个单词的出现频率，并排序</a></li>
<li><a href="#sec-7-4">7.4 统计80端口的连接个数并按照从大到小排列</a></li>
</ul>
</li>
<li><a href="#sec-8">8 校验</a>
<ul>
<li><a href="#sec-8-1">8.1 MD5校验</a></li>
<li><a href="#sec-8-2">8.2 将MD5的值写入文件</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 创建</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 创建两个空文件</h3>
<div class="outline-text-3" id="text-1-1">





<pre class="example">touch file1 file2
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 递归式创建一些嵌套目录</h3>
<div class="outline-text-3" id="text-1-2">





<pre class="example">mkdir -pv /tmp/xxs/dsd/efd
</pre>



</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 复制文件或者目录</h3>
<div class="outline-text-3" id="text-1-3">





<pre class="example">cp -av 原文件或原目录 新文件或新目录
</pre>





</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 查看</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 一屏查看文件内容</h3>
<div class="outline-text-3" id="text-2-1">





<pre class="example">cat 文件名
</pre>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 不显示以＃开头的行</h3>
<div class="outline-text-3" id="text-2-2">





<pre class="example">cat /etc/vsftpd.conf |grep -v ^#
</pre>


</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 分页查看文件内容</h3>
<div class="outline-text-3" id="text-2-3">





<pre class="example">more 文件名
</pre>


</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 可控分页查看文件内容</h3>
<div class="outline-text-3" id="text-2-4">





<pre class="example">less 文件名
</pre>


</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 带行号显示文件的内容</h3>
<div class="outline-text-3" id="text-2-5">





<pre class="example">nl 文件名
cat -n 文件名
</pre>


</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 根据字符串匹配来查看文件部分内容</h3>
<div class="outline-text-3" id="text-2-6">





<pre class="example">grep 字符串 文件名
</pre>


</div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> 回当前用户的宿主目录</h3>
<div class="outline-text-3" id="text-2-7">





<pre class="example">cd ~
# 或者更简单的
cd
</pre>


</div>

</div>

<div id="outline-container-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> 回到上一次的目录</h3>
<div class="outline-text-3" id="text-2-8">





<pre class="example">cd -
</pre>


</div>

</div>

<div id="outline-container-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> 查看当前所在目录的绝对路经</h3>
<div class="outline-text-3" id="text-2-9">





<pre class="example">pwd
</pre>



</div>

</div>

<div id="outline-container-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> 列出当前目录下的所有文件,包括以.开头的隐含文件</h3>
<div class="outline-text-3" id="text-2-10">





<pre class="example">ls -a
</pre>



</div>

</div>

<div id="outline-container-2-11" class="outline-3">
<h3 id="sec-2-11"><span class="section-number-3">2.11</span> 查看文件类型</h3>
<div class="outline-text-3" id="text-2-11">





<pre class="example">file filename
</pre>


</div>

</div>

<div id="outline-container-2-12" class="outline-3">
<h3 id="sec-2-12"><span class="section-number-3">2.12</span> 显示xxx文件倒数6行的内容</h3>
<div class="outline-text-3" id="text-2-12">





<pre class="example">tail -6 xxx
</pre>


</div>

</div>

<div id="outline-container-2-13" class="outline-3">
<h3 id="sec-2-13"><span class="section-number-3">2.13</span> 查看文件中间的第五行（含）到第10行（含）的内容</h3>
<div class="outline-text-3" id="text-2-13">





<pre class="example">sed -n '5,10p' /var/log/apache2/access.log    
</pre>



</div>

</div>

<div id="outline-container-2-14" class="outline-3">
<h3 id="sec-2-14"><span class="section-number-3">2.14</span> 查看当前目录的子目录</h3>
<div class="outline-text-3" id="text-2-14">





<pre class="example">ls -d */ 或 echo */
</pre>


</div>

</div>

<div id="outline-container-2-15" class="outline-3">
<h3 id="sec-2-15"><span class="section-number-3">2.15</span> 将当前目录下最近2小时到8小时之内的文件显示出来</h3>
<div class="outline-text-3" id="text-2-15">





<pre class="example">find . -mmin +120 -mmin -480 -exec more {} \;
</pre>




</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 修改</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 去除文件中的行号</h3>
<div class="outline-text-3" id="text-3-1">





<pre class="example">cut -c 5- a.py
</pre>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 删除文件中的重复行</h3>
<div class="outline-text-3" id="text-3-2">





<pre class="example">cat file.txt |sort -u
</pre>


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 显示包含或者不包含字符串的文件名</h3>
<div class="outline-text-3" id="text-3-3">





<pre class="example">grep -l -r 字符串 路径　#显示内容包含字符串的文件名
grep -L -r 字符串 路径　#显示内容不包含字符串的文件名
find . -path './cache' -prune -o -name "*.php" -exec grep -l "date_cache[$format]['lang']" {} \; #显示当前目录下不包含cache目录的所有含有“date_cache[$format]['lang']”字符串的php文件。
find . -type f -name \*.php -exec grep -l "info" {} \;
</pre>


</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 获得文件的后缀名</h3>
<div class="outline-text-3" id="text-3-4">





<pre class="example">echo xxx.xxx.rmvb |sed 's/.*\(\..*$\)/\1/'    
</pre>


</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 去除文件的后缀名</h3>
<div class="outline-text-3" id="text-3-5">





<pre class="example">echo xxx.xxx.rmvb |sed 's/\(.*\)\..*$/\1/'    
</pre>



</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 移动路径下的文件并改名</h3>
<div class="outline-text-3" id="text-3-6">





<pre class="example">mv 路径/文件  /新路径/新文件名
</pre>



</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> 把所有文件的後辍由rm改为rmvb</h3>
<div class="outline-text-3" id="text-3-7">





<pre class="example">rename 's/.rm$/.rmvb/' *
</pre>


</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> 把所有文件名中的大写改为小写</h3>
<div class="outline-text-3" id="text-3-8">





<pre class="example">rename 'tr/A-Z/a-z/' *
</pre>



</div>

</div>

<div id="outline-container-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> 去掉文件中的^M</h3>
<div class="outline-text-3" id="text-3-9">





<pre class="example">#注意不要使用同样的文件名，会清空掉原文件
cat filename | tr -d "^M" &gt; newfile;
或者
sed -e "s/^M//g" filename &gt; newfile;
或者
ex "+:%s/[Ctrl+V][Enter]//g" "+:wq"  filename #直接修改文件    
</pre>


</div>

</div>

<div id="outline-container-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> 合并多个pdf文件到一个pdf文件</h3>
<div class="outline-text-3" id="text-3-10">






<pre class="example">#apt-get install gs pdftk
gs -dNOPAUSE -sDEVICE=pdfwrite -sOUTPUTFILE=output.pdf -dBATCH input1.pdf input2.pdf
</pre>


</div>

</div>

<div id="outline-container-3-11" class="outline-3">
<h3 id="sec-3-11"><span class="section-number-3">3.11</span> 批量修改文件和目录的权限</h3>
<div class="outline-text-3" id="text-3-11">


<p>
   批量修改src目录下所有文件的权限为644：
</p>



<pre class="example">find src -type f -exec chmod 644 {} \;
</pre>


<p>
   批量修改src目录下的所有子目录的权限为755：
</p>



<pre class="example">find src -type d -exec chmod 755 {} \;
</pre>



</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 删除</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 递归式删除嵌套目录</h3>
<div class="outline-text-3" id="text-4-1">





<pre class="example">rm -fr /tmp/xxs
</pre>


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 删除特殊文件名的文件，如文件名：&ndash;help.txt</h3>
<div class="outline-text-3" id="text-4-2">





<pre class="example">rm -- --help.txt 或者 rm ./--help.txt
</pre>



</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 删除当前目录里面所有的 .svn 目录</h3>
<div class="outline-text-3" id="text-4-3">





<pre class="example">find . -name .svn -type d -exec rm -fr {} \;
</pre>


</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 删除当前目录所有以“~”结尾的临时文件</h3>
<div class="outline-text-3" id="text-4-4">





<pre class="example">find . -name "*~" -exec rm {} \;
</pre>




</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 查找</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 快速查找某个文件</h3>
<div class="outline-text-3" id="text-5-1">





<pre class="example">whereis filename
find 目录 -name 文件名
locate 文件名 # 注意，为了得到更好的效果，运行前可以更新下数据库，运行 sudo updatedb 即可，但这个命令每隔一段时间会自动运行，所以不用太在意
</pre>


</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 查找不以java和xml结尾,并7天没有使用的文件删除掉</h3>
<div class="outline-text-3" id="text-5-2">





<pre class="example">find . ! -name *.java ! -name ‘*.xml’ -atime +7 -exec rm {} \;
</pre>


</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 查找目录下所有有包含abcd文字的文本文件，并替换为xyz</h3>
<div class="outline-text-3" id="text-5-3">





<pre class="example">grep -rIl "abcd" ./* --color=never | xargs sed -i "s/abcd/xyz/g" #注意grep的一个参数是大写的i，一个参数是小写的L
</pre>




</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 比较</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 对比两个文件之间的差异　</h3>
<div class="outline-text-3" id="text-6-1">





<pre class="example">diff file1 file2    
</pre>


</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 比较两个目录里面的文件是否有相同</h3>
<div class="outline-text-3" id="text-6-2">





<pre class="example">diff -r dir1 dir2
</pre>





</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 统计</h2>
<div class="outline-text-2" id="text-7">



</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 统计当前文件个数</h3>
<div class="outline-text-3" id="text-7-1">





<pre class="example">ls /usr/bin|wc -w    
</pre>


</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 统计最常用的10条命令</h3>
<div class="outline-text-3" id="text-7-2">




<pre class="example">history | awk '{CMD[$2]++;count++;}END { for (a in CMD)print CMD[a] " " CMD[a]/count*100 "% " a;}' | grep -v "./" | column -c3 -s " " -t | sort -nr | nl | head -n10    
</pre>



</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 统计每个单词的出现频率，并排序</h3>
<div class="outline-text-3" id="text-7-3">




<pre class="example">awk '{arr[$1]+=1 }END{for(i in arr){print arr[i]"\t"i}}' FILE_NAME | sort -rn
</pre>


</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> 统计80端口的连接个数并按照从大到小排列</h3>
<div class="outline-text-3" id="text-7-4">




<pre class="example">netstat -na|grep :80|awk '{print $5}'|awk -F: '{print $1}'|sort|uniq -c|sort -r -n
</pre>



</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 校验</h2>
<div class="outline-text-2" id="text-8">



</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> MD5校验</h3>
<div class="outline-text-3" id="text-8-1">





<pre class="example">md5 filetohashA.txt
</pre>


</div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 将MD5的值写入文件</h3>
<div class="outline-text-3" id="text-8-2">





<pre class="example">md5sum filetohashA.txt &gt; hash.md5  % 创建hash.md5文件并添加filetohashA.txt的md5值
md5sum filetohashB.txt &gt;&gt; hash.md5 % 往hash.md5文件里添加filetohashB.txt的md5值
</pre>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-11 Wed</p>
<p class="author">Author: Joseph Pan</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
